"""Test cases for plugin output."""

import datetime

from azul_runner import (
    DATA_HASH,
    FV,
    BinaryPlugin,
    Event,
    EventData,
    EventParent,
    Filepath,
    JobResult,
    State,
    Uri,
)
from azul_runner.test_utils import test_template

from azul_plugin_qrcode.main import AzulPluginQrcode


class TestExecute(test_template.TestPlugin):
    PLUGIN_TO_TEST = AzulPluginQrcode

    def test_word_one_qr(self):
        """Test one qr code, multiple images"""

        result = self.do_execution(
            data_in=[
                (
                    "content",
                    self.load_test_file_bytes(
                        "00a9e9faeda48898ad3c32a429071b46d3b848d628028aa0362be3250d8eed26",
                        "Word document with mallicious qr code, from vt",
                    ),
                )
            ],
            verify_input_content=False,
        )

        self.assertJobResult(
            result,
            JobResult(
                state=State(State.Label.COMPLETED),
                events=[
                    Event(
                        sha256="00a9e9faeda48898ad3c32a429071b46d3b848d628028aa0362be3250d8eed26",
                        features={
                            "qr_code_data_raw": [
                                FV(
                                    "https://s3.eu-west-1.amazonaws.com/disputration.avrlcamsheonionprec24923/ovilocapitalorientation23024.htm"
                                )
                            ],
                            "qr_code_orientation": [FV("UP")],
                            "qr_code_polygon": [
                                FV("[Point(x=6, y=7), Point(x=6, y=243), Point(x=243, y=243), Point(x=243, y=7)]")
                            ],
                            "qr_code_quality": [FV("1")],
                            "qr_code_rect": [FV("Rect(left=6, top=7, width=237, height=236)")],
                            "qr_code_type": [FV("QRCODE")],
                            "qr_code_uri": [
                                FV(
                                    "https://s3.eu-west-1.amazonaws.com/disputration.avrlcamsheonionprec24923/ovilocapitalorientation23024.htm"
                                )
                            ],
                        },
                    )
                ],
            ),
        )

    def test_word_multiple_qr(self):
        """Test multiple qr codes in a word file"""

        result = self.do_execution(
            data_in=[
                (
                    "content",
                    self.load_test_file_bytes(
                        "8357fa180ba400355483d3e3ad9a1ff49561f810fdcbd9653e2e887aaf64e4e0",
                        "Crafted word document with multiple qr codes",
                    ),
                )
            ],
            verify_input_content=False,
        )

        self.assertJobResult(
            result,
            JobResult(
                state=State(State.Label.COMPLETED),
                events=[
                    Event(
                        sha256="8357fa180ba400355483d3e3ad9a1ff49561f810fdcbd9653e2e887aaf64e4e0",
                        features={
                            "qr_code_data_raw": [
                                FV("The Beatles -- Abbey Road"),
                                FV(
                                    "国78曜カム観合チサカセ受著ヌス味強エスメ給高正スチ学風提リ善7題へスら劇割はが辞落ぼト無図も同誠えど形谷むら好品身ちでかト飛3敢渓窮さびどフ。南ラユホ弾到ク想掲おドむき詳別56証モスメ口香チテユウ社雇全レ書当ぎたる然提もぴこ再断モセニ車加リコモレ作送く医督いぴ撃健クッぞ撤又娠イぐ。\n\n利ロキテ能告ぞょさま利石ゆひ浜19分本アトカ情検62経やラぜぶ情本マテ九府メ火朝フ入加よひ修筆富ぜぼざづ。天ど詳右断ヤ付業ゃっだ勢室イタク一書アサ坊逼ケセルモ体統下クじ受劭テキク人森オ検47合フあでな要必面みぜし意具イ転長タヲセ見問っざ刻浮ゃのてか。迅ユヤ大献キモヱナ供九映線トさへく額府ぱぎぶ旗最ト書刊ヒコ政7一イ秀領ゅわほ注碁ずぽぐ夢回5検九ばさ国乏咋塞どぼえフ。\n\n8題頑マトヘノ稿量てどご荷鑑5去やれがび剤質ヲイフ教任タクム摂夜週ハトワ今原ルヨ岡氏ヱメロ流見てげ井波ッ村之押旬そづ。崎はぴリば載朝感キヌ多更ぼば教歩た出体ッづリ収毎げ採治きつほ演29東ふばな会要ルヘノソ屋育よずせ豊嗣けおや。界介ラ加模クぞ気也ヱア負足講ど告助シカ国写統無ヒ口霊スユサア案敬影ぼほレ組一ぎげ交崎着枠越せぐ。\n\n55竜敢渓窮8女ぽゃ索惑4地ロフサミ盟幸けそこま抜援ヌヤツス問真やじ面就はまべ長棋ごるぎき反問スシハ方能セユア版湾ムセ需者売トよぞ点任じぶや門辺基審れや。名サウニ権組米ちづ中通ぽつ大公ヤレ者要5所謙ぽびぶ際郎セアメヌ予年45経ウイヨリ主虜ツメスヌ贈告マヌ報実けざ被彰奏訳迷や。通エル大市キマユ真年フ石読モミ線間そ認祭死格ぞぱばた気男ぎべ大再ょ老済ド成出氏のぽ森道ノエ亡誇誤郡のぞ。\n\n暮ヒ品趣セチニ居育イ界実ムワキ然押イムクチ路北領イヨラ脂他ニサハ加9北げわ町村ケ済特えせた止矢え経戦ルけ奈民ヌムト引回い確福をゆあつ名表ぽれむ思健ア超40否支うそド。絡クれ結使ルヨ販代たよ約読ほ異使ず行告すお中賞35串剱5工ぐたま況入般康37街ばクを慎囲コメ球米うかざぶ世著ぞ読旗昼栗謎げ。"
                                ),
                                FV("https://www.youtube.com/watch?v=dQw4w9WgXcQ"),
                            ],
                            "qr_code_orientation": [FV("UP")],
                            "qr_code_polygon": [
                                FV("[Point(x=10, y=16), Point(x=10, y=177), Point(x=169, y=176), Point(x=169, y=16)]"),
                                FV(
                                    "[Point(x=14, y=14), Point(x=15, y=1140), Point(x=1141, y=1141), Point(x=1140, y=15)]"
                                ),
                                FV("[Point(x=65, y=46), Point(x=65, y=177), Point(x=196, y=177), Point(x=196, y=46)]"),
                            ],
                            "qr_code_quality": [FV("1")],
                            "qr_code_rect": [
                                FV("Rect(left=10, top=16, width=159, height=161)"),
                                FV("Rect(left=14, top=14, width=1127, height=1127)"),
                                FV("Rect(left=65, top=46, width=131, height=131)"),
                            ],
                            "qr_code_type": [FV("QRCODE")],
                            "qr_code_uri": [FV("https://www.youtube.com/watch?v=dQw4w9WgXcQ")],
                        },
                    )
                ],
            ),
        )

    def test_pdf_qr(self):
        """Test a qr code in a pdf file"""

        result = self.do_execution(
            data_in=[
                (
                    "content",
                    self.load_test_file_bytes(
                        "ee2b3ada9fa45c197bf99a60495c9900b2b1f88e6a80732bb61157ef1e4f46e3",
                        "Crafted pdf document with multiple qr codes",
                    ),
                )
            ],
            verify_input_content=False,
        )

        self.assertJobResult(
            result,
            JobResult(
                state=State(State.Label.COMPLETED),
                events=[
                    Event(
                        sha256="ee2b3ada9fa45c197bf99a60495c9900b2b1f88e6a80732bb61157ef1e4f46e3",
                        features={
                            "qr_code_data_raw": [
                                FV("The Beatles -- Abbey Road"),
                                FV(
                                    "国78曜カム観合チサカセ受著ヌス味強エスメ給高正スチ学風提リ善7題へスら劇割はが辞落ぼト無図も同誠えど形谷むら好品身ちでかト飛3敢渓窮さびどフ。南ラユホ弾到ク想掲おドむき詳別56証モスメ口香チテユウ社雇全レ書当ぎたる然提もぴこ再断モセニ車加リコモレ作送く医督いぴ撃健クッぞ撤又娠イぐ。\n\n利ロキテ能告ぞょさま利石ゆひ浜19分本アトカ情検62経やラぜぶ情本マテ九府メ火朝フ入加よひ修筆富ぜぼざづ。天ど詳右断ヤ付業ゃっだ勢室イタク一書アサ坊逼ケセルモ体統下クじ受劭テキク人森オ検47合フあでな要必面みぜし意具イ転長タヲセ見問っざ刻浮ゃのてか。迅ユヤ大献キモヱナ供九映線トさへく額府ぱぎぶ旗最ト書刊ヒコ政7一イ秀領ゅわほ注碁ずぽぐ夢回5検九ばさ国乏咋塞どぼえフ。\n\n8題頑マトヘノ稿量てどご荷鑑5去やれがび剤質ヲイフ教任タクム摂夜週ハトワ今原ルヨ岡氏ヱメロ流見てげ井波ッ村之押旬そづ。崎はぴリば載朝感キヌ多更ぼば教歩た出体ッづリ収毎げ採治きつほ演29東ふばな会要ルヘノソ屋育よずせ豊嗣けおや。界介ラ加模クぞ気也ヱア負足講ど告助シカ国写統無ヒ口霊スユサア案敬影ぼほレ組一ぎげ交崎着枠越せぐ。\n\n55竜敢渓窮8女ぽゃ索惑4地ロフサミ盟幸けそこま抜援ヌヤツス問真やじ面就はまべ長棋ごるぎき反問スシハ方能セユア版湾ムセ需者売トよぞ点任じぶや門辺基審れや。名サウニ権組米ちづ中通ぽつ大公ヤレ者要5所謙ぽびぶ際郎セアメヌ予年45経ウイヨリ主虜ツメスヌ贈告マヌ報実けざ被彰奏訳迷や。通エル大市キマユ真年フ石読モミ線間そ認祭死格ぞぱばた気男ぎべ大再ょ老済ド成出氏のぽ森道ノエ亡誇誤郡のぞ。\n\n暮ヒ品趣セチニ居育イ界実ムワキ然押イムクチ路北領イヨラ脂他ニサハ加9北げわ町村ケ済特えせた止矢え経戦ルけ奈民ヌムト引回い確福をゆあつ名表ぽれむ思健ア超40否支うそド。絡クれ結使ルヨ販代たよ約読ほ異使ず行告すお中賞35串剱5工ぐたま況入般康37街ばクを慎囲コメ球米うかざぶ世著ぞ読旗昼栗謎げ。"
                                ),
                            ],
                            "qr_code_orientation": [FV("UP")],
                            "qr_code_polygon": [
                                FV(
                                    "[Point(x=14, y=14), Point(x=15, y=1140), Point(x=1141, y=1141), Point(x=1140, y=15)]"
                                ),
                                FV("[Point(x=65, y=46), Point(x=65, y=177), Point(x=196, y=177), Point(x=196, y=46)]"),
                            ],
                            "qr_code_quality": [FV("1")],
                            "qr_code_rect": [
                                FV("Rect(left=14, top=14, width=1127, height=1127)"),
                                FV("Rect(left=65, top=46, width=131, height=131)"),
                            ],
                            "qr_code_type": [FV("QRCODE")],
                        },
                    )
                ],
            ),
        )

    def test_ppt_qr(self):
        """Tests a qr code in a powerpoint presentation"""

        result = self.do_execution(
            data_in=[
                (
                    "content",
                    self.load_test_file_bytes(
                        "e07d177e6c4caf3c8db7f82f05649b6ea29aeb6aa104c4c19ef617a6407e36e9",
                        "Crafted powerpoint with qr code",
                    ),
                )
            ],
            verify_input_content=False,
        )

        self.assertJobResult(
            result,
            JobResult(
                state=State(State.Label.COMPLETED),
                events=[
                    Event(
                        sha256="e07d177e6c4caf3c8db7f82f05649b6ea29aeb6aa104c4c19ef617a6407e36e9",
                        features={
                            "qr_code_data_raw": [
                                FV(
                                    "国78曜カム観合チサカセ受著ヌス味強エスメ給高正スチ学風提リ善7題へスら劇割はが辞落ぼト無図も同誠えど形谷むら好品身ちでかト飛3敢渓窮さびどフ。南ラユホ弾到ク想掲おドむき詳別56証モスメ口香チテユウ社雇全レ書当ぎたる然提もぴこ再断モセニ車加リコモレ作送く医督いぴ撃健クッぞ撤又娠イぐ。\n\n利ロキテ能告ぞょさま利石ゆひ浜19分本アトカ情検62経やラぜぶ情本マテ九府メ火朝フ入加よひ修筆富ぜぼざづ。天ど詳右断ヤ付業ゃっだ勢室イタク一書アサ坊逼ケセルモ体統下クじ受劭テキク人森オ検47合フあでな要必面みぜし意具イ転長タヲセ見問っざ刻浮ゃのてか。迅ユヤ大献キモヱナ供九映線トさへく額府ぱぎぶ旗最ト書刊ヒコ政7一イ秀領ゅわほ注碁ずぽぐ夢回5検九ばさ国乏咋塞どぼえフ。\n\n8題頑マトヘノ稿量てどご荷鑑5去やれがび剤質ヲイフ教任タクム摂夜週ハトワ今原ルヨ岡氏ヱメロ流見てげ井波ッ村之押旬そづ。崎はぴリば載朝感キヌ多更ぼば教歩た出体ッづリ収毎げ採治きつほ演29東ふばな会要ルヘノソ屋育よずせ豊嗣けおや。界介ラ加模クぞ気也ヱア負足講ど告助シカ国写統無ヒ口霊スユサア案敬影ぼほレ組一ぎげ交崎着枠越せぐ。\n\n55竜敢渓窮8女ぽゃ索惑4地ロフサミ盟幸けそこま抜援ヌヤツス問真やじ面就はまべ長棋ごるぎき反問スシハ方能セユア版湾ムセ需者売トよぞ点任じぶや門辺基審れや。名サウニ権組米ちづ中通ぽつ大公ヤレ者要5所謙ぽびぶ際郎セアメヌ予年45経ウイヨリ主虜ツメスヌ贈告マヌ報実けざ被彰奏訳迷や。通エル大市キマユ真年フ石読モミ線間そ認祭死格ぞぱばた気男ぎべ大再ょ老済ド成出氏のぽ森道ノエ亡誇誤郡のぞ。\n\n暮ヒ品趣セチニ居育イ界実ムワキ然押イムクチ路北領イヨラ脂他ニサハ加9北げわ町村ケ済特えせた止矢え経戦ルけ奈民ヌムト引回い確福をゆあつ名表ぽれむ思健ア超40否支うそド。絡クれ結使ルヨ販代たよ約読ほ異使ず行告すお中賞35串剱5工ぐたま況入般康37街ばクを慎囲コメ球米うかざぶ世著ぞ読旗昼栗謎げ。"
                                )
                            ],
                            "qr_code_orientation": [FV("UP")],
                            "qr_code_polygon": [
                                FV("[Point(x=20, y=20), Point(x=21, y=824), Point(x=825, y=825), Point(x=824, y=21)]")
                            ],
                            "qr_code_quality": [FV("1")],
                            "qr_code_rect": [FV("Rect(left=20, top=20, width=805, height=805)")],
                            "qr_code_type": [FV("QRCODE")],
                        },
                    )
                ],
            ),
        )

    def test_png_qr(self):
        """Test a qr code in a png file"""

        result = self.do_execution(
            data_in=[
                (
                    "content",
                    self.load_test_file_bytes(
                        "d66991bb032f27a48b8eca64a4998c800624a0a1ae879656c9b0f12184cc546e",
                        "Png qr code.",
                    ),
                )
            ],
            verify_input_content=False,
        )

        self.assertJobResult(
            result,
            JobResult(
                state=State(State.Label.COMPLETED),
                events=[
                    Event(
                        sha256="d66991bb032f27a48b8eca64a4998c800624a0a1ae879656c9b0f12184cc546e",
                        features={
                            "qr_code_data_raw": [FV("https://example.com")],
                            "qr_code_orientation": [FV("UP")],
                            "qr_code_polygon": [
                                FV("[Point(x=39, y=39), Point(x=39, y=330), Point(x=331, y=331), Point(x=330, y=39)]")
                            ],
                            "qr_code_quality": [FV("1")],
                            "qr_code_rect": [FV("Rect(left=39, top=39, width=292, height=292)")],
                            "qr_code_type": [FV("QRCODE")],
                            "qr_code_uri": [FV("https://example.com")],
                        },
                    )
                ],
            ),
        )

    def test_large_qr(self):
        """Tests a large qr code that is longer than the max length for a feature"""

        result = self.do_execution(
            data_in=[
                (
                    "content",
                    self.load_test_file_bytes(
                        "297e8b81de66abb3a6590a40e018b15964328a89dc41c26abd8ed552b7976978",
                        "Png with large qr code.",
                    ),
                )
            ],
            verify_input_content=False,
        )

        self.assertJobResult(
            result,
            JobResult(
                state=State(State.Label.COMPLETED),
                events=[
                    Event(
                        sha256="297e8b81de66abb3a6590a40e018b15964328a89dc41c26abd8ed552b7976978",
                        data=[
                            EventData(
                                hash="3826f1c79b676b6bd868be10d6a2c11dc70e7a4868d0cd19ccbd4fdb730795ba", label="text"
                            )
                        ],
                        features={
                            "qr_code_data_raw": [
                                FV(
                                    "1685630112335360832202645361424565062444032821272968148840232003687350198346169404178396646959526522710330874339473086390786765607047958672599186415452625393100058100918109983482287955869502445228534450622190822794972199796247011776671796069733285608859772392044617784924384587257669368716004843299456737485794252015642596007083157352540252837520528634967102215597977359662216552721018257676300977575732645957271883701777697415974955031179310610282539360593519668204523282521015607436889756513997595418180710750261839354069829596403498538708156849549303869972208591858836149237330839668599037833694790729486086565808137209574820462128336687849732664402410661095890410786456220930854088968997575562172979988614907276815066502945116085674066898689252512161494290296780985316956106348084610977990693878282770970512192217078955490842653663607130442748042407421968116384476023114419676296651073165682767079194452784652557008547746425866670546810146026218089583069829042751575934195604904499354077551268668749318714319208592875330107084873015842049710352725349203785574385965197573539898548692152173207989043455839965198179438367613128665296522060487393004793696555705942304388590539908134228269514878219140899747331553451976601645343994084550783755026949516694857934212045182797116415657504218949056811287436375049939003620806592931285914774987032206138389231060967291026542441940406184490542163346261657119945372047123775158946485350294789792246239707080483363373504486502802506633430589015861548736400760190886482832976291031076195715736472930341345193119698971934896394406467816621866932822317658128709109950163320180933408091515652854138588166309949832401640644918781994038723691271150400913659690070318241143866377508597365175067546426040751025317913220533107937577821318212734941277948879477193404915944007440793611780245245074912445727533522969707977249888463696178908307632579787043321282519502245219149582584801973300526762153330745181908194320736830784651260710608030022598100832929562293213881821921525571912894588061107701320841387413659872877630570159317486766748453153142000717710793589028825289608131745049197337231513544167090486072288892988411303887061298374588887372608916293226238714784454802031428700818666619090840845207244875402113609626304338800186478218197201920094289629020564066844253576903954527523924216733273219942372943240157578141712119205545107711519134433854389016086448857259247255015676035802034636110690961674502074282856894454346195741076761869607370589256753316018950248970388281209655990471839694647323733533324638364221923491979106614643917242985312210654412975228640176997961347449734553975514276697622516280399830272085997261863972164076897385504420053003869024498510826476866854283837643357752569387470527242299339417466253648959965824934145865924610782304351906524479428860687071194733163510970466018351310098362024892155534021276215120987836177402088144039290013751022040317001216647931614594213434438231877410192716042835485133823690285502181552961491000826649245341870330733511919428477641074018115956309265717544263487824945730714440854299273197791788462286140062582337526082672385960633111682891715311754031657634690356169444969950364737413492430195748434933520797219658659680096713535196231935843105420763819984751509058925396814344992848171871287642854539388162266473422339008319871143610963112561211407221642227934710732833258063516176526720241344678561985188757886447639316632695274691939136049826367172899894047686447508321022535822315749688696101555069675767470431763911391783807930424623641396884550192411936118641730775716495557150470867377456497536619346887260321152356436642116388607123338167499384551947284783768832152842271419592131843408545698064384338925850888057372797370785991532570068321577942581257743746805608427616661603367752930497578349451375639701092672090055985491730111728135474529748230622775299518020837865981488944635910479833528060831015327943943381641240968955935442213179929024437429120064380370615245327236940276478817879..."
                                )
                            ],
                            "qr_code_orientation": [FV("UP")],
                            "qr_code_polygon": [
                                FV(
                                    "[Point(x=40, y=40), Point(x=41, y=1569), Point(x=1569, y=1569), Point(x=1569, y=41)]"
                                )
                            ],
                            "qr_code_quality": [FV("1")],
                            "qr_code_rect": [FV("Rect(left=40, top=40, width=1529, height=1529)")],
                            "qr_code_type": [FV("QRCODE")],
                        },
                    )
                ],
                data={"3826f1c79b676b6bd868be10d6a2c11dc70e7a4868d0cd19ccbd4fdb730795ba": b""},
            ),
        )
